In [2]:
import pandas as pd

C:\Users\user\AppData\Local\Temp\ipykernel_8152\4080736814.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [3]:
ratings1 = pd.read_csv('data/ratings1.csv')
ratings2 = pd.read_csv('data/ratings2.csv')
dates = pd.read_csv('data/dates.csv')
movies = pd.read_csv('data/movies.csv')

In [4]:
ratings1

       userId  movieId  rating
0           1        1     4.0
1           1        3     4.0
2           1        6     4.0
3           1       47     5.0
4           1       50     5.0
...       ...      ...     ...
39996     274     5582     2.5
39997     274     5585     3.5
39998     274     5588     3.5
39999     274     5618     4.0
40000     274     5621     2.0

[40001 rows x 3 columns]

In [5]:
ratings2

       userId  movieId  rating
0         274     5621     2.0
1         274     5630     3.0
2         274     5667     3.5
3         274     5679     3.5
4         274     5690     3.0
...       ...      ...     ...
60831     610   166534     4.0
60832     610   168248     5.0
60833     610   168250     5.0
60834     610   168252     5.0
60835     610   170875     3.0

[60836 rows x 3 columns]

In [6]:
movies.nunique()

movieId    9742
title      9737
genres      951
dtype: int64

In [7]:
ratings1.nunique()

userId      274
movieId    6219
rating       10
dtype: int64

In [8]:
dates

                       date
0       2000-07-30 18:45:03
1       2000-07-30 18:20:47
2       2000-07-30 18:37:04
3       2000-07-30 19:03:35
4       2000-07-30 18:48:51
...                     ...
100831  2017-05-03 21:53:22
100832  2017-05-03 22:21:31
100833  2017-05-08 19:50:47
100834  2017-05-03 21:19:12
100835  2017-05-03 21:20:15

[100836 rows x 1 columns]

In [9]:
year = pd.to_datetime(dates['date'])

In [10]:
year.dt.year.value_counts()

date
2000    10061
2017     8198
2007     7114
2016     6703
2015     6616
2018     6418
1996     6040
2005     5813
2012     4656
2008     4351
2009     4158
2006     4059
2003     4014
2001     3922
2002     3478
2004     3279
1999     2439
2010     2301
1997     1916
2011     1690
2013     1664
2014     1439
1998      507
Name: count, dtype: int64

In [11]:
ratings = pd.concat([ratings1, ratings2],ignore_index=True)
display(ratings)

        userId  movieId  rating
0            1        1     4.0
1            1        3     4.0
2            1        6     4.0
3            1       47     5.0
4            1       50     5.0
...        ...      ...     ...
100832     610   166534     4.0
100833     610   168248     5.0
100834     610   168250     5.0
100835     610   168252     5.0
100836     610   170875     3.0

[100837 rows x 3 columns]

In [12]:
print('Число строк в таблице ratings: ', ratings.shape[0])
print('Число строк в таблице dates: ', dates.shape[0])
print(ratings.shape[0] == dates.shape[0])

Число строк в таблице ratings:  100837
Число строк в таблице dates:  100836
False

In [13]:
display(ratings1.tail(1))
display(ratings2.head(1))

       userId  movieId  rating
40000     274     5621     2.0

   userId  movieId  rating
0     274     5621     2.0

In [14]:
ratings = ratings.drop_duplicates(ignore_index=True)
print('Число строк в таблице ratings: ', ratings.shape[0])

Число строк в таблице ratings:  100836

In [15]:
ratings_dates = pd.concat([ratings, dates], axis=1)
display(ratings_dates.tail(7))

        userId  movieId  rating                 date
100829     610   164179     5.0  2017-05-03 21:07:11
100830     610   166528     4.0  2017-05-04 06:29:25
100831     610   166534     4.0  2017-05-03 21:53:22
100832     610   168248     5.0  2017-05-03 22:21:31
100833     610   168250     5.0  2017-05-08 19:50:47
100834     610   168252     5.0  2017-05-03 21:19:12
100835     610   170875     3.0  2017-05-03 21:20:15

In [16]:
import os
def concat_user_files(path):
    lables = os.listdir(path)
    lables.sort()
    df_to_concat = []
    for lable in lables:
        p = path+'/'+lable
        lable = pd.read_csv(p)
        df_to_concat.append(lable)
    concated_df = pd.concat(df_to_concat, ignore_index=True)    
    concated_df.drop_duplicates(ignore_index=True, inplace=True)
    return concated_df

In [17]:
#  эталон
# import pandas as pd
# import os

# def concat_user_files(path):
#     data = pd.DataFrame()
#     file_names = os.listdir(path)
#     file_names.sort()
#     for file in file_names:
#         tmp_data = pd.read_csv(path + '/' + file)
#         data = pd.concat([data, tmp_data], axis=0, ignore_index=True)
#     data = data.drop_duplicates()
#     return data

In [18]:
df1 = pd.DataFrame(
    [(1,'a', 73, 'men'),
     (2,'b', 48, 'men'),
     (3,'c', 63, 'wumen'),
     (4,'a', 75, 'wumen'),
     (5,'c', 71, 'wumen'),
     (6,'b', 77, 'men'),
     (7,'d', 78, 'wumen')],
    columns=['id','categori', 'weight','gender']
)
df2 = pd.DataFrame(
    [(1, 172, 22 ),
     (2, 171, 20 ),
     (3, 162, 32 ),
     (4, 192, 25 ),
     (5, 172, 44 ),
     (6, 142, 37 ),
     (7, 199, 15 )],
    columns=['id', 'high', 'age']
)
df3 = df1.join(df2, how='left', rsuffix='_2')
df3

   id categori  weight gender  id_2  high  age
0   1        a      73    men     1   172   22
1   2        b      48    men     2   171   20
2   3        c      63  wumen     3   162   32
3   4        a      75  wumen     4   192   25
4   5        c      71  wumen     5   172   44
5   6        b      77    men     6   142   37
6   7        d      78  wumen     7   199   15

In [26]:
df1 = pd.DataFrame(
    [(1, 2),
     (5, 6)],
    columns=['A', 'B'],
    index= [0,1]
)
df2 = pd.DataFrame(
    [(3, 4),
     (7, 8)
     ],
    columns=['A', 'C'],
    index=[0,2]
)
df3 = df1.join(df2, how='outer', rsuffix='_2' )
df3

     A    B  A_2    C
0  1.0  2.0  3.0  4.0
1  5.0  6.0  NaN  NaN
2  NaN  NaN  7.0  8.0